{
  "chunks": [

    {"id":"osha-soil-a","category":"Safety","title":"OSHA Soil Type A — Trenching","content":"Type A soil is the most stable. Cohesive soils with unconfined compressive strength of 1.5 tons per square foot or greater. Includes stiff clay, hardpan, caliche. No fissuring, no previous disturbance, no water seepage. Required slope: 3/4:1 (0.75H per 1V). Thumb penetration test: thumb barely penetrates. Pocket penetrometer reads 1.5 tsf or more.","url":"/resources.html#osha-excavation","tags":["OSHA","soil","Type A","trench","excavation","slope","clay"]},
    {"id":"osha-soil-b","category":"Safety","title":"OSHA Soil Type B — Trenching","content":"Type B soil has cohesive or granular properties with unconfined compressive strength between 0.5 and 1.5 tsf. Includes angular gravel, silty clay, previously disturbed Type A soil, fissured soils. Required slope: 1:1 (1H per 1V). Most common soil classification in urban trench work. Thumb penetration 0.25 to 1 inch.","url":"/resources.html#osha-excavation","tags":["OSHA","soil","Type B","trench","excavation","slope","clay","gravel"]},
    {"id":"osha-soil-c","category":"Safety","title":"OSHA Soil Type C — Trenching","content":"Type C is the least stable soil classification. Cohesive soils with unconfined strength less than 0.5 tsf, granular soils like sand and gravel, submerged soil, soil subject to water infiltration, or layered systems sloping into excavation. Required slope: 1.5:1 (1.5H per 1V). Benching is NOT permitted in Type C. Thumb penetrates more than 1 inch.","url":"/resources.html#osha-excavation","tags":["OSHA","soil","Type C","trench","excavation","slope","sand","gravel","water"]},
    {"id":"osha-slopes","category":"Safety","title":"OSHA Required Slope Angles by Soil Type","content":"OSHA 29 CFR 1926 Appendix B slope requirements: Type A soil — 53 degrees, 3/4:1 H:V ratio, 0.75 ft horizontal setback per foot of depth. Type B soil — 45 degrees, 1:1 H:V ratio, 1.0 ft setback per foot. Type C soil — 34 degrees, 1.5:1 H:V ratio, 1.5 ft setback per foot. Stable rock — 90 degrees vertical is allowed.","url":"/resources.html#osha-excavation","tags":["OSHA","slope","angle","trench","excavation","safety"]},
    {"id":"osha-competent-person","category":"Safety","title":"Competent Person Requirements — OSHA Excavation","content":"A competent person must be present during all excavation work per OSHA 29 CFR 1926.651. Daily checklist: classify soil before workers enter, locate utilities (811 called 3+ days prior), surface encumbrances removed, spoil placed 2 ft minimum from edge, protective system in place, access and egress within 25 LF, water accumulation evaluated, atmospheric testing if depth over 4 ft, adjacent structures evaluated, inspection after rain or freeze-thaw.","url":"/resources.html#osha-excavation","tags":["OSHA","competent person","daily","inspection","excavation","trench"]},
    {"id":"osha-trench-shield","category":"Safety","title":"Trench Shield and Box Requirements — OSHA","content":"Trench shields (boxes) are permitted in all soil types as an alternative to sloping or shoring. Requirements: must extend 18 inches above top of unstable soil or within 2 ft of surface in stable soil. Workers must exit the shield before repositioning. Must be designed by a PE or meet manufacturer tabulated data. Spoil minimum 2 ft from trench edge. Maximum 2 ft of unprotected trench in front of and behind the shield.","url":"/resources.html#osha-excavation","tags":["OSHA","trench shield","trench box","shoring","excavation","safety"]},
    {"id":"osha-ppe","category":"Safety","title":"OSHA PPE Requirements — Construction","content":"29 CFR 1926 Subpart E personal protective equipment for construction. Hard hat required where head injury risk exists — Class E for electrical. Safety glasses for grinding, drilling, concrete work. High visibility vest Class 2 minimum near traffic, Class 3 on highway ROW. Steel-toe boots for heavy equipment and material handling. Hearing protection when noise exceeds 85 dBA TWA. Fall protection at 6 ft leading edges. Respiratory protection for silica dust — PEL 50 micrograms per cubic meter.","url":"/resources.html#osha-ppe","tags":["OSHA","PPE","hard hat","safety glasses","high vis","hearing protection","silica"]},
    {"id":"osha-silica","category":"Safety","title":"OSHA Silica Rule 1926.1153","content":"OSHA silica standard effective 2017. Permissible Exposure Limit: 50 micrograms per cubic meter 8-hour TWA. Action level: 25 micrograms per cubic meter. Employers must have a written exposure control plan, limit worker exposure, and provide medical surveillance. Applies to grinding, cutting, or drilling concrete, stone, or mortar. N95 respirator minimum for silica exposure.","url":"/resources.html#osha-ppe","tags":["OSHA","silica","respiration","PEL","concrete","grinding","health"]},
    {"id":"confined-space","category":"Safety","title":"Confined Space Entry — Construction OSHA 1926.1200","content":"Confined spaces in construction regulated under 29 CFR 1926.1200. A permit-required confined space has a hazardous atmosphere, engulfment risk, internal configuration hazard, or other serious safety risk. Atmospheric testing order: 1) oxygen content (must be 19.5-23.5%), 2) flammable gases below 10% LEL, 3) toxic contaminants below PEL. Common confined spaces in underground utility: manholes, valve vaults, wet wells, lift stations. Over 60% of confined space fatalities are rescuers — never enter to rescue without proper equipment.","url":"/resources.html#confined-space","tags":["confined space","manhole","vault","oxygen","H2S","methane","entry permit"]},
    {"id":"bluestakes-811","category":"Safety","title":"811 Blue Stakes — Call Before You Dig","content":"811 is the national call before you dig number. Blue Stakes of Utah administers the program in Utah. Utah Code 54-8a requires notification at least 3 business days (72 hours) before any excavation. The 5 steps: 1) Call or click 811, 2) Wait the full time, 3) Confirm all markings via EPR, 4) Respect and protect marks, 5) Hand dig within 24 inches of each mark (tolerance zone). Failure to notify can result in fines and full liability for damage.","url":"/resources.html#bluestakes","tags":["811","blue stakes","call before dig","utility locate","excavation","Utah","tolerance zone"]},
    {"id":"utility-colors","category":"Reference","title":"Utility Marking Color Codes — APWA Standard","content":"APWA uniform color code for underground utility markings. Red: electric power lines, cables, conduit, lighting. Orange: telecommunication, alarm, signal lines, cable TV, fiber optic. Yellow: gas, oil, steam, petroleum, gaseous materials. Green: sewers, storm drain, drain tile. Blue: potable water. Purple: reclaimed water, irrigation, non-potable. Pink: temporary survey markings, unknown utilities. White: proposed excavation area — mark your dig zone in white. Gray: temporary dewatering lines.","url":"/resources.html#color-codes","tags":["utility","color codes","APWA","red","orange","yellow","green","blue","purple","pink","white","marking"]},
    {"id":"calc-trench-volume","category":"Calculator","title":"Trench Volume Calculator","content":"Calculate excavation volume, backfill, bedding, and spoil for a trench. Inputs: trench length in linear feet, width in feet, depth in feet, pipe OD in inches, bedding thickness in inches, soil swell factor percentage, import backfill option. Outputs: excavation cubic yards, pipe void, bedding CY and tons, backfill required CY, spoil to haul CY with swell, spoil weight in tons. Swell factor: 25% typical for clay/silty soils, 10-15% for sand, 30-40% for rock.","url":"/calculators.html#trench-volume","tags":["trench","volume","excavation","cubic yards","backfill","spoil","bedding","swell","takeoff"]},
    {"id":"calc-pipe-flow","category":"Calculator","title":"Pipe Flow Calculator — Manning's Equation","content":"Calculate gravity pipe flow capacity and velocity using Manning's equation Q equals (1/n) times A times R to the 2/3 power times S to the 1/2 power. Inputs: pipe diameter in inches, pipe slope in ft/ft, Manning's n coefficient, flow depth ratio d/D. Manning's n values: concrete RCP 0.013, PVC 0.012, HDPE 0.011, ductile iron 0.015, CMP 0.024. Outputs: flow in GPM and CFS, velocity in ft/s, flow area. Maximum hydraulic capacity occurs at about 93% full not 100%.","url":"/calculators.html#pipe-flow","tags":["Manning","pipe flow","GPM","CFS","velocity","slope","gravity","sewer","storm","hydraulics"]},
    {"id":"calc-min-slope","category":"Calculator","title":"Minimum Pipe Slope Calculator","content":"Calculate minimum slope required to achieve self-cleaning velocity in gravity sewer and storm drain. ASCE MOP 36 minimum: 2.0 ft/s at design flow. Recommended: 2.5 ft/s. Formula: slope equals (velocity times n divided by R to the 2/3) squared. Larger diameter pipe needs less slope. Inputs: pipe diameter, Manning's n, target velocity. Output: minimum slope in ft/ft and percent, drop per 100 LF in feet and inches.","url":"/calculators.html#min-slope","tags":["minimum slope","self cleaning","velocity","sewer","ASCE","gravity","pipe","slope"]},
    {"id":"calc-trench-safety","category":"Calculator","title":"Trench Safety Calculator — OSHA","content":"Calculate OSHA required protective system dimensions based on soil type, trench depth, and protection method. Soil types A, B, C. Methods: sloping, benching, trench shield. Outputs slope ratio, horizontal setback each side, total top width. Benching not permitted in Type C soil. Any excavation over 5 feet requires a protective system. Over 20 feet requires PE designed system.","url":"/calculators.html#trench-safety","tags":["OSHA","trench safety","slope","bench","shield","excavation","soil type","protective system"]},
    {"id":"calc-thrust-block","category":"Calculator","title":"Thrust Block Sizing Calculator","content":"Calculate thrust force and concrete bearing area for pipe fittings. Thrust formula: T equals 2 times P times A times sin of half the bend angle for bends. T equals P times A for dead ends and tees. Inputs: pipe diameter inches, test pressure PSI, fitting type (90 degree, 45 degree, 22.5 degree, tee, dead end), soil bearing capacity PSF. Outputs: thrust in pounds force, minimum bearing area SF, design area with safety factor, approximate square block dimensions, concrete volume in CY.","url":"/calculators.html#thrust-block","tags":["thrust block","concrete","fitting","bend","tee","dead end","pressure","bearing","pipe"]},
    {"id":"calc-grade-slope","category":"Calculator","title":"Grade and Slope Calculator","content":"Convert between percent grade, ft/ft slope, degrees, and rise over run. Calculate elevation change over a distance. Calculate grade from two elevations. Outputs: grade percentage, ft/ft ratio, angle in degrees, drop or rise over specified distance, slope ratio H:V.","url":"/calculators.html#grade-slope","tags":["grade","slope","elevation","percent","ft/ft","degrees","rise","run","survey"]},
    {"id":"calc-compaction","category":"Calculator","title":"Compaction Calculator — Relative Compaction and Lifts","content":"Calculate relative compaction from Proctor test data. Formula: relative compaction equals field dry density divided by max dry density times 100. Common requirements: 95% Standard Proctor for trench backfill standard, 90% for subgrade or fill, 98% for pavement subbase. Also calculate number of lifts needed: divide total fill depth by lift thickness per compactor type. Vibratory plate: 6-8 inch lifts. Jumping jack tamper: 4-8 inch lifts. Hand tamper: 3-6 inch lifts.","url":"/calculators.html#compaction","tags":["compaction","Proctor","dry density","relative compaction","lifts","tamper","backfill","subbase"]},
    {"id":"calc-markup","category":"Calculator","title":"Markup and Bid Price Calculator","content":"Calculate bid price from direct cost using separate overhead and profit. Formula: bid equals direct cost times (1 plus overhead) times (1 plus profit). Typical heavy civil overhead: 10-15%. Profit: 8-15% depending on risk. Also reverse: bid price to implied direct cost. Shows overhead dollar amount, profit dollar amount, total markup percentage on cost, and margin on bid.","url":"/calculators.html#markup","tags":["markup","bid price","overhead","profit","margin","estimate","cost"]},
    {"id":"calc-unit-price","category":"Calculator","title":"Unit Price Builder Calculator","content":"Build a unit bid price from material, labor, equipment, and subcontractor cost components. Applies overhead and profit markup to get the unit bid price. Multiplies by quantity for extended total. Units: LF, CY, EA, TON, SF, LS. Shows each cost component per unit and the final bid price per unit with extended total.","url":"/calculators.html#unit-price","tags":["unit price","bid","material","labor","equipment","markup","LF","CY","estimate"]},
    {"id":"calc-change-order","category":"Calculator","title":"Change Order Calculator","content":"Calculate change order value on time and materials or unit price basis. T&M inputs: labor hours and rates by trade, equipment hours and rates, material cost. Unit price inputs: description, quantity, unit, unit price. Applies overhead and profit percentage and bond rate. Outputs subtotal, O&P, bond, and total change order value.","url":"/calculators.html#change-order","tags":["change order","T&M","time and materials","O&P","bond","markup","CO"]},
    {"id":"calc-production-rate","category":"Calculator","title":"Production Rate Calculator","content":"Calculate project duration, cost per unit, and total direct cost from production rate. Typical production rates heavy civil: 8-inch waterline 150-300 LF per day. 8-inch sewer 100-200 LF per day. Trench excavation 300-600 LF per day. Backfill 400-800 LF per day. Inputs: production rate per day, total quantity, crew size, crew hourly rate, hours per day, equipment daily cost.","url":"/calculators.html#production-rate","tags":["production rate","LF per day","duration","crew","cost per LF","schedule","estimate"]},
    {"id":"calc-crew-day","category":"Calculator","title":"Crew Day Cost Calculator","content":"Calculate total daily crew cost with dynamic add-remove labor and equipment rows. Inputs: role name, hours, hourly rate per worker, equipment daily rates, small tools allowance, overhead burden percentage. Outputs labor total by person, equipment total, subtotal, overhead, and total day cost. Useful for T&M pricing and daily report cost tracking.","url":"/calculators.html#crew-day","tags":["crew day","labor cost","equipment","daily cost","T&M","overhead","foreman","operator","laborer"]},
    {"id":"calc-unit-converter","category":"Calculator","title":"Construction Unit Converter","content":"Convert between construction units across 7 categories. Volume: CY, CF, CI, gallons, liters, cubic meters. Area: SF, SY, acres, square meters. Weight: pounds, short tons, metric tons, kilograms. Pressure: PSI, PSF, bar, kPa, ft of water, meters of water. Length: feet, inches, yards, miles, meters, millimeters. Flow: GPM, CFS, liters per second, MGD. Earthwork: BCY, LCY with 25/30/40% swell, CCY with 10/15/20% shrink.","url":"/calculators.html#unit-converter","tags":["unit converter","CY","CF","PSI","GPM","CFS","BCY","LCY","swell","shrink","earthwork","volume","pressure"]},
    {"id":"calc-concrete","category":"Calculator","title":"Concrete Volume Calculator","content":"Calculate concrete volume in cubic yards for slabs, walls, and cylinders or manholes. Slab: length times width times thickness divided by 27. Wall: length times height times thickness. Cylinder or manhole: pi divided by 4 times (OD squared minus ID squared) times height. Applies waste factor. Shows net CY, CY with waste, cost estimate by PSI strength, and number of truck loads.","url":"/calculators.html#concrete-volume","tags":["concrete","cubic yards","slab","wall","manhole","vault","cylinder","volume","CY"]},
    {"id":"calc-asphalt","category":"Calculator","title":"Asphalt Tonnage Calculator","content":"Calculate hot mix asphalt tonnage for pavement, patching, or trench restoration. HMA density approximately 145 lb per CF. Formula: area times thickness in feet times density divided by 2000 equals tons. Applies waste factor. Shows net tonnage, tonnage with waste, and material cost. Typical densities: dense graded HMA 140-150 lb/CF, SMA 148-152, open graded 110-120.","url":"/calculators.html#asphalt-tonnage","tags":["asphalt","HMA","tonnage","pavement","trench restoration","tons","density","paving"]},
    {"id":"calc-pipe-qty","category":"Calculator","title":"Pipe and Fittings Quantity Calculator","content":"Calculate pipe, fittings, and bedding quantities for a pipeline. Inputs: pipe length LF, diameter inches, pipe material, joint length, number of 90-degree elbows, 45-degree elbows, tees, couplings. Also calculates bedding volume and crushed rock tonnage based on bedding depth and trench width. Materials: PVC C900, HDPE, DIP, PVC SDR 35, RCP, steel.","url":"/calculators.html#pipe-quantity","tags":["pipe","fittings","quantity","bedding","elbow","tee","coupling","takeoff","LF"]},
    {"id":"mannings-n-values","category":"Reference","title":"Manning's n Roughness Coefficient Values","content":"Manning's n reference for common pipe and channel materials. Concrete pipe RCP: 0.011-0.013-0.015. PVC pipe: 0.010-0.012-0.013. HDPE smooth: 0.009-0.011-0.013. Ductile iron: 0.013-0.015-0.016. Steel welded: 0.012-0.014-0.017. Corrugated metal CMP: 0.020-0.024-0.030. Vitrified clay VCP: 0.011-0.013-0.015. Cast iron: 0.012-0.013-0.015. Concrete lined channel: 0.012-0.013-0.015. Earth channel clean: 0.020-0.025-0.030.","url":"/calculators.html#mannings-n","tags":["Manning's n","roughness","concrete","PVC","HDPE","ductile iron","CMP","channel","pipe"]},
    {"id":"pipe-pvc-c900","category":"Reference","title":"PVC C900 Pipe Specifications","content":"PVC C900 pressure pipe for water distribution. AWWA C900 standard. Size range 4 to 60 inches. Push-on gasket joints. DR18 rating 165 PSI, DR14 rating 200 PSI. Common OD: 4-inch 4.500 in, 6-inch 6.625 in, 8-inch 8.625 in, 10-inch 10.750 in, 12-inch 12.750 in. Most common water distribution pipe material in the US.","url":"/calculators.html#pipe-reference","tags":["PVC","C900","pipe","waterline","water main","DR18","DR14","AWWA","pressure"]},
    {"id":"pipe-hdpe","category":"Reference","title":"HDPE Pipe Specifications","content":"High density polyethylene pipe. ASTM D3035 standard. Fully restrained joints via butt fusion or electrofusion. DR11 rating 200 PSI, DR17 rating 100 PSI. Excellent for directional drill crossings, force mains, rough soil. OD: 4-inch 4.500 in (DR11 wall 0.409 in, DR17 wall 0.265 in), 6-inch 6.625 in, 8-inch 8.625 in. Sizes half inch through 63 inch. Flexible joint accommodates ground movement.","url":"/calculators.html#pipe-reference","tags":["HDPE","pipe","directional drill","force main","fusion","DR11","DR17","ASTM","flexible"]},
    {"id":"pipe-dip","category":"Reference","title":"Ductile Iron Pipe Specifications","content":"Ductile iron pipe for water and pressure sewer. AWWA C151 standard. Size range 3 to 64 inches. Push-on or mechanical joints. Pressure Class 350 standard. OD: 4-inch 4.800 in, 6-inch 6.900 in, 8-inch 9.050 in, 10-inch 11.100 in, 12-inch 13.200 in. Weight: 4-inch 13.35 lb/ft, 8-inch 27.75 lb/ft, 12-inch 47.03 lb/ft. Restrained joints required at fittings and on long runs.","url":"/calculators.html#pipe-reference","tags":["DIP","ductile iron","pipe","waterline","AWWA","mechanical joint","restrained","Megalug","TR Flex"]},
    {"id":"pipe-rcp","category":"Reference","title":"Reinforced Concrete Pipe Specifications","content":"Reinforced concrete pipe for storm drain and culverts. ASTM C76 standard. Class III most common. Gravity flow only. Size range 12 to 144 inches. Wall B construction. OD: 12-inch 14.0 in (weight 79 lb/ft), 18-inch 21.0 in (weight 174 lb/ft), 24-inch 27.0 in (weight 289 lb/ft), 36-inch 39.0 in (weight 563 lb/ft). Bell and spigot with O-ring gasket joint.","url":"/calculators.html#pipe-reference","tags":["RCP","concrete","pipe","storm drain","culvert","gravity","ASTM","Class III"]},
    {"id":"soil-classification","category":"Reference","title":"Soil Classification Reference — Swell Shrink Bearing","content":"Soil engineering properties for construction. Sand clean: swell 10-15%, shrink 5-10%, bearing 1500-3000 PSF. Gravel: swell 10-20%, shrink 5-10%, bearing 3000-6000 PSF. Silty clay: swell 20-30%, shrink 10-15%, bearing 1000-2000 PSF. Stiff clay: swell 25-35%, shrink 15-20%, bearing 2000-4000 PSF. Soft clay: swell 30-40%, shrink 20-25%, bearing 500-1000 PSF. Rock soft: swell 25-40%, bearing 10000-50000 PSF. Rock hard: swell 30-50%, bearing 50000+ PSF.","url":"/resources.html#soil-types","tags":["soil","swell","shrink","bearing capacity","clay","sand","gravel","rock","earthwork"]},
    {"id":"esop-explained","category":"Companies","title":"What is an ESOP — Employee Stock Ownership Plan","content":"An ESOP is a qualified retirement plan that holds company stock for employees. In construction, employees gradually become owners without paying out of pocket. Shares allocated annually based on compensation or tenure. Vesting typically 3-6 years. When employees leave or retire the ESOP buys back shares at fair market value. S-corp ESOPs may eliminate federal income tax on ESOP-owned profit. Common reasons contractors go ESOP: succession planning, recruiting retention, tax benefits, culture, protection from private equity acquisition.","url":"/companies.html#what-is-esop","tags":["ESOP","employee owned","ownership","succession","tax","retirement","stock","construction company"]},
    {"id":"esop-companies","category":"Companies","title":"Major ESOP Construction Companies","content":"Major employee-owned heavy civil contractors. Emery Sapp and Sons: 1600+ employee owners, Midwest heavy civil, revenue 500M+, parent of ESS Companies. Achen-Gardner Construction: 350+ owners, Arizona Southwest, underground utility and heavy civil. ESCO Construction: 175+ owners, Idaho Mountain West, founded 1944. Rummel Construction: 750+ owners, Arizona Southwest. Monks Construction: 150+ owners, Colorado. Sundt Construction: 100% ESOP since 1990, 2B+ revenue. Kiewit Corporation: employee owned, 14B+ revenue. Hensel Phelps: employee owned 5B+.","url":"/companies.html#esop","tags":["ESOP","employee owned","Emery Sapp","Achen-Gardner","ESCO","Rummel","Kiewit","Sundt","Hensel Phelps","ESS Companies"]},
    {"id":"utah-contractors","category":"Companies","title":"Major Utah Construction Contractors","content":"Large construction contractors based in or operating heavily in Utah. Ames Construction: major UDOT heavy civil, highways, earthwork, 1B+. Geneva Rock Products: vertically integrated aggregate asphalt concrete, 500M-1B, Orem Utah. W.W. Clyde and Co: Utah heavy civil highways bridges earthwork, Springville Utah. Wadsworth Brothers: bridges culverts underground utilities transportation, Draper Utah. Big-D Construction: commercial GC, 1B+, Salt Lake City. Okland Corp: commercial GC, 1B+, Salt Lake City. Staker Parson: aggregate paving Oldcastle subsidiary.","url":"/companies.html#utah","tags":["Utah","contractor","Ames","Geneva Rock","WW Clyde","Wadsworth","Big-D","Okland","UDOT","heavy civil"]},
    {"id":"national-contractors","category":"Companies","title":"ENR Top National Construction Contractors 2025","content":"Largest US contractors by revenue per ENR 2025. Bechtel: 23.5B, private, engineering and construction. Turner Construction: 16B, commercial GC, subsidiary of HOCHTIEF. Fluor Corporation: 15.6B, public NYSE FLR, industrial infrastructure. Kiewit Corporation: 14B+, private employee owned, heavy civil mining power. EMCOR Group: 14.3B, public NYSE EME, mechanical electrical. Jacobs Solutions: 10.7B, public NYSE J, engineering CM. Granite Construction: 4.3B, public NYSE GVA, heavy civil. MYR Group: 3.6B, public NASDAQ MYRG, electrical. Primoris: 5.6B, public NASDAQ PRIM, underground pipeline utility.","url":"/companies.html#national","tags":["ENR","top 400","national","Bechtel","Turner","Fluor","Kiewit","EMCOR","Granite","MYR","Primoris","revenue"]},
    {"id":"iija-market","category":"Industry","title":"IIJA Infrastructure Spending and Market Growth 2024","content":"Infrastructure Investment and Jobs Act: 1.2 trillion total, largest infrastructure bill in US history. Water and sewer: 55 billion over 5 years. Roads and bridges: 110 billion. Power grid: 73 billion. Broadband: 65 billion. Transit: 39 billion. Airport: 25 billion. 2024 construction market growth: telecommunications plus 59.7%, sewer and water plus 23.7%, power plus 18.9%, oil and gas plus 16.6%, transportation plus 11.4%. Top 400 contractors combined 600 billion revenue in 2024, up 7.9% year over year.","url":"/companies.html#market-data","tags":["IIJA","infrastructure","spending","market","growth","water","sewer","roads","bridges","ENR","2024"]},
    {"id":"ownership-types","category":"Industry","title":"Construction Company Ownership Types Explained","content":"Private founder owned: owner or family holds equity, most small to mid contractors, flexible decision making. ESOP employee owned: employees are owners through trust, strong retention, tax advantages, common in heavy civil. Private equity backed: PE firm driving 5-7 year exit, growth focus, aggressive bidding. Publicly traded: stock on NYSE or NASDAQ, quarterly earnings pressure, fully transparent SEC filings. Examples public: Granite GVA, EMCOR EME, MYR Group MYRG, Primoris PRIM.","url":"/companies.html#ownership-types","tags":["ownership","private","ESOP","private equity","PE","public","stock","SEC","quarterly earnings"]},
    {"id":"python-hydraulics","category":"Tools","title":"Python Hydraulics Tools — pipe_flow_full and minimum_slope","content":"openmud Python tools for hydraulic calculations. pipe_flow_full(diameter_in, slope, n) calculates Manning's full pipe flow in CFS and GPM, velocity in ft/s, area, and hydraulic radius. pipe_flow_partial(diameter_in, slope, depth_ratio, n) calculates partial flow at any d/D ratio. minimum_slope(diameter_in, target_velocity, n) solves for minimum slope to achieve self-cleaning velocity. flow_to_slope(diameter_in, target_flow_gpm, n) finds required slope for a target flow. Available via: from tools.field.hydraulics import pipe_flow_full, minimum_slope.","url":"https://github.com/masonearl/openmud/tree/main/tools/field","tags":["Python","hydraulics","Manning","pipe flow","minimum slope","CFS","GPM","velocity","code","library"]},
    {"id":"python-trench","category":"Tools","title":"Python Trench and Quantity Tools","content":"openmud Python tools for trench and quantity calculations. trench_volume(length_ft, width_ft, depth_ft, pipe_od_in, bedding_depth_in, swell_pct, import_backfill) returns excavation CY, backfill CY, bedding CY, spoil CY. thrust_block(diameter_in, pressure_psi, fitting_type, soil_bearing_psf) returns thrust force and bearing area. asphalt_tonnage(area_sf, thickness_in, density, waste_pct, price). concrete_volume(shape, dimensions). Available via: from tools.field.trench import trench_volume, thrust_block.","url":"https://github.com/masonearl/openmud/tree/main/tools/field","tags":["Python","trench","volume","thrust block","asphalt","concrete","code","library","takeoff"]},
    {"id":"python-bid","category":"Tools","title":"Python Bid and Cost Tools","content":"openmud Python bid calculation tools. markup_bid_price(direct_cost, overhead_pct, profit_pct) returns bid price with breakdown. unit_price(material, labor, equipment, sub, overhead, profit, quantity, unit) builds unit bid price. change_order_tm(labor_items, equipment_items, material_cost, op_pct, bond_pct) calculates T&M change order total. production_rate(rate, quantity, crew_size, crew_rate, hours, equipment, unit) returns duration and cost per unit. crew_day_cost(labor_items, equipment_items, tools, overhead) returns total day cost. from tools.calculations.bid_tools import markup_bid_price.","url":"https://github.com/masonearl/openmud/tree/main/tools/calculations","tags":["Python","bid","markup","unit price","change order","production rate","crew","cost","library"]},
    {"id":"python-converter","category":"Tools","title":"Python Unit Converter Tool","content":"openmud unit conversion library. convert(value, from_unit, to_unit, category) converts between any units within a category. Categories: volume (CY CF gallons liters), area (SF SY acres), weight (lb tons kg), pressure (PSI PSF bar kPa ft water), length (ft inches yards miles meters), flow (GPM CFS LPS MGD), earthwork (BCY LCY CCY with swell and shrink factors). bulk_convert(value, from_unit, category) returns all unit conversions at once. from tools.calculations.unit_converter import convert.","url":"https://github.com/masonearl/openmud/tree/main/tools/calculations","tags":["Python","unit","convert","CY","PSI","GPM","BCY","LCY","volume","pressure","earthwork","library"]},
    {"id":"standards-awwa","category":"Reference","title":"AWWA Standards for Water Pipe","content":"American Water Works Association standards for water distribution. AWWA C900: PVC pressure pipe 4-60 inch. AWWA C151: ductile iron pipe specifications. AWWA C200: steel water pipe. AWWA C104: cement mortar lining for DIP. AWWA C900 DR ratings: DR18 165 PSI, DR14 200 PSI, DR11 235 PSI. All pressure rated for water distribution service.","url":"/resources.html#standards","tags":["AWWA","standards","water","pipe","PVC","ductile iron","steel","C900","C151","pressure class"]},
    {"id":"standards-astm","category":"Reference","title":"ASTM Standards for Sewer and Storm Pipe","content":"ASTM standards for gravity sewer and storm drain pipe. ASTM D3034: PVC sewer pipe SDR 35 gravity flow 4-15 inch. ASTM D3035: HDPE pipe for pressure applications. ASTM C76: reinforced concrete pipe storm drain Class I through V. ASTM C700: vitrified clay pipe. ASTM F679: PVC large diameter gravity sewer 18 inch and larger. ASTM D2241: PVC pressure rated pipe SDR 17.","url":"/resources.html#standards","tags":["ASTM","standards","sewer","storm","PVC","HDPE","concrete","VCP","SDR35","gravity"]},
    {"id":"youtube-channels","category":"Resources","title":"Best YouTube Channels for Heavy Civil Construction","content":"Top construction YouTube channels. Heavy Construction Academy: equipment operation heavy civil fundamentals excavators graders scrapers. Premier Underground Construction: real underground utility pipe installation trench work. Stanley Dirt Monkey Genadek: excavation landscaping field operations production rates. Trimble Civil Construction: machine control GPS grade technology layout. BuildWitt Aaron Witt: workforce development culture future of heavy civil. Construction Leading Edge: business systems project management leadership. Caterpillar: equipment operation maintenance machine technology. Komatsu: smart construction autonomous equipment machine control.","url":"/resources.html#youtube","tags":["YouTube","BuildWitt","Aaron Witt","Heavy Construction Academy","Dirt Monkey","Trimble","Caterpillar","Komatsu","video","education"]},
    {"id":"construction-news","category":"Resources","title":"Construction News and AI in Construction Sources","content":"Best sources for construction news and AI updates. Construction Dive: free daily construction news, industry technology labor policy. Engineering News-Record ENR: industry paper of record, Top 400 list, rankings, some paywall. Construction Executive: business focused finance risk technology. Construction Industry AI: dedicated AI in construction news monthly roundups tool reviews. Construction Dive Technology section: free AI robotics BIM drones software news. The Dirt World Podcast BuildWitt: Aaron Witt interviews contractors and leaders.","url":"/resources.html#news","tags":["news","Construction Dive","ENR","AI","contech","Construction Executive","podcast","BuildWitt"]},
    {"id":"glossary-811","category":"Glossary","title":"Construction Glossary — 811 to Confined Space","content":"Key construction terms. 811: national call before you dig number. AASHTO: American Association of State Highway and Transportation Officials. Angle of repose: steepest angle loose material stays stable. APWA: sets utility color codes. As-builts: drawings reflecting actual constructed conditions. AWWA: American Water Works Association sets water pipe standards. Backfill: material refilling trench after pipe install. BCY: bank cubic yards in-place soil volume. Bedding: granular material below and around pipe. Blue stakes: Utah 811 utility locating program. Bore: directional drill or jack-and-bore trenchless install. Butt fusion: HDPE joining method heating and pressing pipe ends.","url":"/resources.html#glossary","tags":["glossary","terms","811","BCY","bedding","blue stakes","bore","butt fusion","AWWA","as-builts"]},
    {"id":"glossary-ccyto-force","category":"Glossary","title":"Construction Glossary — CCY to Force Main","content":"Key construction terms continued. CCY: compacted cubic yards after compaction, 10-20% less than BCY. Change order: written document modifying contract scope price or schedule. CIP: cast iron pipe older water distribution. CMP: corrugated metal pipe for culverts and storm drain. Competent person: OSHA defined person who identifies excavation hazards. Compaction: mechanical densification of soil. Confined space: limited entry not for continuous occupancy like manholes. D/B: design-build project delivery. Dewatering: removal of groundwater from excavation. DIP: ductile iron pipe for water and pressure sewer. DR: dimension ratio pipe OD divided by wall thickness. EPR: electronic positive response for 811 locate status. Force main: pressurized sewer pipe using pump pressure.","url":"/resources.html#glossary","tags":["glossary","CCY","change order","CMP","compaction","confined space","dewatering","DIP","DR","force main"]},
    {"id":"glossary-gvwto-work-zone","category":"Glossary","title":"Construction Glossary — GVW to Work Zone","content":"Key construction terms. GVW: gross vehicle weight. Haunching: bedding material at sides of pipe from bedding to springline. HDD: horizontal directional drilling trenchless pipe install. HDPE: high density polyethylene pipe flexible fusion joints. Invert: lowest interior point of pipe, invert elevations control flow. LCY: loose cubic yards after excavation with swell. LEL: lower explosive limit for confined space. Potholing: hand excavating to expose utilities before digging. Prevailing wage: minimum rates on public works projects. RFI: request for information asking engineer to clarify. ROW: right of way legal corridor for construction. Schedule of values: contract price breakdown by work item for pay apps. Spoil: excavated material minimum 2 ft from trench edge. Swell: volume increase of soil when excavated. T&M: time and materials basis for change orders. Tolerance zone: 24 inches each side of utility marks hand dig only.","url":"/resources.html#glossary","tags":["glossary","HDD","HDPE","invert","LCY","LEL","potholing","prevailing wage","RFI","ROW","spoil","swell","T&M","tolerance zone"]},
    {"id":"openmud-mission","category":"About","title":"openmud Mission and Platform Overview","content":"openmud is an open source AI platform for heavy civil and underground utility construction. MIT license, completely free, no paywall. Mission: make AI a practical tool for every phase of the job from bid to closeout. The platform includes AI chat tuned for heavy civil, 18 construction calculators, OSHA and 811 safety reference, construction company directory, Python tool library for developers, open source GitHub repository at github.com/masonearl/openmud. Goal: automate the monotony of construction — bid generation, proposal documents, daily reports, takeoffs, email filtering, document extraction, RFI tracking, scheduling. Built by contractors for contractors.","url":"/about.html","tags":["openmud","mission","open source","MIT","AI","construction","estimating","proposal","bid","automate","GitHub"]},
    {"id":"openmud-chat","category":"Tools","title":"openmud AI Chat — mud1 GPT-4o Claude","content":"openmud AI chat at openmud.ai/chat. Multi-model support: mud1 (custom heavy civil model built on GPT-4o-mini), GPT-4o, GPT-4o-mini, GPT-4 Turbo, Claude Haiku 4.5, Claude Sonnet 4.6, Claude Opus 4.6. mud1 is tuned with construction context for estimating scheduling proposals underground utility work. Chat generates schedules with PDF export and proposals with PDF export. Quick estimate tool built into chat interface. Project management with named projects.","url":"/chat.html","tags":["AI","chat","mud1","GPT-4o","Claude","construction AI","estimate","proposal","schedule","PDF"]},
    {"id":"contribute-openmud","category":"About","title":"How to Contribute to openmud","content":"openmud welcomes contributions from contractors, estimators, field engineers, and developers. Ways to contribute: improve pricing data in tools/estimating/estimating_tools.py — regional labor rates, material costs, equipment rental. Add new calculators to calculators.html and assets/js/calculators.js. Build new Python tools in the tools/ directory. Improve AI prompts in api/chat.js SYSTEM_PROMPTS. Fix bugs, improve UI, add mobile support. Submit a pull request on GitHub: fork the repo, create a branch, open a PR describing what you built and why it matters in the field.","url":"https://github.com/masonearl/openmud/blob/main/CONTRIBUTING.md","tags":["contribute","GitHub","PR","pull request","fork","pricing","tools","open source","community"]}
  ]
}
